;
(function (window, document, $) {
  var config = {
    constant: {
      preUrl: '//www.yuntask.com'
    },
    reg: {
      //  6~20位，至少一个数字，小写字母或大写字母。
      password: /^(?![^a-zA-Z]+$)(?!\D+$).{6,20}$/,
      // 手机号
      mobile: /^1[3456789]{10}$/,
      qq: /^\d{4,}$/,
      url: /^(([0-9a-zA-Z_!~*'().&=+$%-]+: )?[0-9a-zA-Z_!~*'().&=+$%-]+@)?((\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5]$)|([0-9a-zA-Z_!~*'()-]+\.)*([0-9a-zA-Z][0-9a-z-]{0,61})?[0-9a-zA-Z]\.[a-zA-Z]{2,6})(:[0-9]{1,4})?((\/?)|(\/[0-9a-zA-Z_!~*'().;?:@&=+$,%#-]+)+\/?)$/
    }
  }

  window.config = config;

})(window, document, jQuery)